УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ТранспортнаяНакладная</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.КонтурЛогистика_Вспомогательный</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает возможные типы данных
// 
// Возвращаемое значение:
//  Структура - типы данных
//
Функция ТипыДанных() Экспорт
	
	ТипыДанных = Новый Структура;
	ТипыДанных.Вставить("ГСМ", "ГорючеСмазочныеМатериалы");
	
	Возврат ТипыДанных;
	
КонецФункции

// Возвращает описание полей по типу данных
//
// Параметры:
//  ТипДанных	 - Строка	 - См. ТипыДанных()
// 
// Возвращаемое значение:
//  Структура - описание полей по типу данных
//
Функция ПараметрыПолейПоТипуДанных(ТипДанных) Экспорт
	
	ОписаниеПолей = Новый Структура;
	ОписаниеПолей.Вставить("ОрганизацияДиадок", ОписаниеПоляТипаДанных("Организация"));
	ОписаниеПолей.Вставить("ТипДанных", ОписаниеПоляТипаДанных("Тип данных"));
	ОписаниеПолей.Вставить("Разрез1", ОписаниеПоляТипаДанных("Разрез 1"));
	ОписаниеПолей.Вставить("Разрез2", ОписаниеПоляТипаДанных("Разрез 2"));
	ОписаниеПолей.Вставить("Разрез3", ОписаниеПоляТипаДанных("Разрез 3"));
	ОписаниеПолей.Вставить("Количество", ОписаниеПоляТипаДанных("Количество"));
	ОписаниеПолей.Вставить("Дата", ОписаниеПоляТипаДанных("Дата"));
	ОписаниеПолей.Вставить("Ответственный", ОписаниеПоляТипаДанных("Ответственный"));
	ОписаниеПолей.Вставить("Реквизит1", ОписаниеПоляТипаДанных("Реквизит1"));
	
	Если ТипДанных = "ГорючеСмазочныеМатериалы" Тогда
		ОписаниеПолей.Разрез1.Заголовок = "Epl Id";
		ОписаниеПолей.Разрез1.НКРСВидимость = Ложь;
		
		ОписаниеПолей.Разрез2.Заголовок = "Тип показаний";
		ОписаниеПолей.Разрез2.НКРСПодсказка = "Будет выполнена конвертация для выбранного типа показаний. Если не указать, то по всем.";
		ОписаниеПолей.Разрез2.НКРСПодсказкаВвода = "выберете тип показаний для отбора";
		
		ОписаниеПолей.Разрез3.Заголовок = "Идентификатор записи";
		ОписаниеПолей.Разрез3.НКРСВидимость = Ложь;
		
		ОписаниеПолей.Реквизит1.Заголовок = "Горюче-смазочные материалы";
	КонецЕсли;
	
	Возврат ОписаниеПолей;
	
КонецФункции

// Манифест записи
// 
// Возвращаемое значение:
//  Структура - представление записи регистра
//
Функция МанифестЗаписи() Экспорт
	
	Манифест = Новый Структура;
	Манифест.Вставить("ОрганизацияДиадок");
	Манифест.Вставить("ТипДанных");
	Манифест.Вставить("Разрез1");
	Манифест.Вставить("Разрез2");
	Манифест.Вставить("Разрез3");
	
	Манифест.Вставить("Количество");
	
	Манифест.Вставить("Дата");
	Манифест.Вставить("Ответственный");
	Манифест.Вставить("Реквизит1");
	
	Возврат Манифест;
	
КонецФункции

// Обновляет статусы синхронизации
//
// Параметры:
//  ДанныеОтбора	 - Структура	 - См. МанифестЗаписи
//  СтатусССервисом	 - ПеречислениеСсылка.КонтурЛогистика_СтатусыСинхронизации	 - Статус синхронизация с сервисом
//  СтатусС1С		 - ПеречислениеСсылка.КонтурЛогистика_СтатусыСинхронизации	 - Статус синхронизация с объектом 1С
//  ТекстОшибки		 - Строка	 - Текст ошибки
//
Процедура ОбновитьСтатусыСинхронизации(ДанныеОтбора, СтатусССервисом, СтатусС1С, ТекстОшибки, НастройкаКонвертацииРС = Неопределено, ДокументОснование = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ДанныеОтбора.ОрганизацияДиадок);
	НаборЗаписей.Отбор.ТипДанных.Установить(ДанныеОтбора.ТипДанных);
	НаборЗаписей.Отбор.Разрез1.Установить(ДанныеОтбора.Разрез1);
	НаборЗаписей.Отбор.Разрез2.Установить(ДанныеОтбора.Разрез2);
	НаборЗаписей.Отбор.Разрез3.Установить(ДанныеОтбора.Разрез3);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из НаборЗаписей Цикл
		
		Если СтатусССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.Пропустить
			И ТекущаяСтрока.СинхронизацияССервисом = Перечисления.КонтурЛогистика_СтатусыСинхронизации.УспешноЗавершена Тогда
			// Не пропускаем успешно синхронизированные с сервисом
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусССервисом) Тогда
			ТекущаяСтрока.СинхронизацияССервисом = СтатусССервисом;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусС1С) Тогда
			ТекущаяСтрока.СинхронизацияСОбъектом1С = СтатусС1С;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекущаяСтрока.ТекстОшибки = ТекстОшибки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастройкаКонвертацииРС) Тогда
			ТекущаяСтрока.НастройкаКонвертацииРС = НастройкаКонвертацииРС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ТекущаяСтрока.ДокументОснование = ДокументОснование;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура - Изменить разрез3 записи
//
// Параметры:
//  ДанныеОтбора - Структура	 - См. МанифестЗаписи
//  Разрез3До	 - Строка	 - Значение до
//  Разрез3После - Строка	 - Значение после
//
Процедура ИзменитьРазрез3Записи(ДанныеОтбора, Разрез3До, Разрез3После) Экспорт
	
	// Новый набор
	НовыйНаборЗаписей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.СоздатьНаборЗаписей();
	НовыйНаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ДанныеОтбора.ОрганизацияДиадок);
	НовыйНаборЗаписей.Отбор.ТипДанных.Установить(ДанныеОтбора.ТипДанных);
	НовыйНаборЗаписей.Отбор.Разрез1.Установить(ДанныеОтбора.Разрез1);
	НовыйНаборЗаписей.Отбор.Разрез2.Установить(ДанныеОтбора.Разрез2);
	НовыйНаборЗаписей.Отбор.Разрез3.Установить(Разрез3После);
	НовыйНаборЗаписей.Прочитать();
	
	// Прочитаем
	НаборЗаписей = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ДанныеОтбора.ОрганизацияДиадок);
	НаборЗаписей.Отбор.ТипДанных.Установить(ДанныеОтбора.ТипДанных);
	НаборЗаписей.Отбор.Разрез1.Установить(ДанныеОтбора.Разрез1);
	НаборЗаписей.Отбор.Разрез2.Установить(ДанныеОтбора.Разрез2);
	НаборЗаписей.Отбор.Разрез3.Установить(Разрез3До);
	НаборЗаписей.Прочитать();
	
	// Скопируем данные
	НоваяЗапись = НовыйНаборЗаписей.Добавить();
	Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяЗапись);
		НоваяЗапись.Разрез3 = Разрез3После;
	КонецЦикла;
	
	// Удалим старую
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	// Запишем новую
	НовыйНаборЗаписей.Записать();
	
КонецПроцедуры

// Представление количества ошибок
//
// Параметры:
//  Период		 - СтандартныйПериод	 - Период
//  ТипЛогистика - Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов	 - Тип документа логистики
// 
// Возвращаемое значение:
//  Строка - Представление количества ошибок
//
Функция ПредставлениеКоличестваОшибок(Знач Период, ТипЛогистика = Неопределено) Экспорт
	
	ПредставлениеКоличестваОшибок = "";
	
	Если ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		И ТипЛогистика <> Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда
		
		Возврат ПредставлениеКоличестваОшибок;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДанных", ТипыДанных().ГСМ);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("СинхронизацияССервисом", Перечисления.КонтурЛогистика_СтатусыСинхронизации.Ошибка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КонтурЛогистика_ПроизвольныеДанные.Разрез1) КАК КоличествоОшибок,
	|	МИНИМУМ(КонтурЛогистика_ПроизвольныеДанные.Дата) КАК МинимальнаяДатаСобытия
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И (КонтурЛогистика_ПроизвольныеДанные.СинхронизацияССервисом = &СинхронизацияССервисом
	|			ИЛИ КонтурЛогистика_ПроизвольныеДанные.СинхронизацияСОбъектом1С = &СинхронизацияССервисом)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.КоличествоОшибок = 0 Тогда
			ПредставлениеКоличестваОшибок = "";
		Иначе
			ПредставлениеКоличестваОшибок = "ГСМ: " + Формат(Выборка.КоличествоОшибок, "ЧГ=0")
				+ " " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьОшибкиВСклонении(Выборка.КоличествоОшибок)
				+ " с " + Формат(Выборка.МинимальнаяДатаСобытия, "ДФ=dd.MM.yy");
		КонецЕсли;
		
	Иначе
		
		ПредставлениеКоличестваОшибок = "";
		
	КонецЕсли;
	
	Возврат ПредставлениеКоличестваОшибок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПоляТипаДанных(Заголовок)
	
	Описание = Новый Структура;
	Описание.Вставить("Заголовок", Заголовок);
	Описание.Вставить("НКРСВидимость", Истина);
	Описание.Вставить("НКРСПодсказка", "");
	Описание.Вставить("НКРСПодсказкаВвода", "");
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
